#### SpecTypeId.String Members

---

|  |
| --- |
| SpecTypeId String Class   Properties   See Also |

This class contains constants identifying specs.

The  SpecTypeId String  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | MultilineText | Multiline Text, in discipline Common. |
| Public property Static member | Text | Text, in discipline Common. |
| Public property Static member | Url | URL, in discipline Common. |

# See Also

SpecTypeId String Class

Autodesk.Revit.DB Namespace